Reports/New Test Suite/20190813_132720/requests/main/2.har

{
  "log" : {
    "version" : "1.2",
    "pages" : [ ],
    "entries" : [ {
      "request" : {
        "method" : "SOAP",
        "url" : "http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso?WSDL",
        "httpVersion" : "",
        "cookies" : [ ],
        "headers" : [ {
          "name" : "Authorization",
          "value" : "Basic SGFtemE6MTIzNDU2"
        } ],
        "queryString" : [ {
          "name" : "WSDL",
          "value" : ""
        } ],
        "postData" : {
          "mimeType" : "application/octet-stream",
          "text" : "<Envelope xmlns=\"http://schemas.xmlsoap.org/soap/envelope/\">\n    <Body>\n        <CountryName xmlns=\"http://www.oorsprong.org/websamples.countryinfo\">\n            <sCountryISOCode>AX</sCountryISOCode>\n        </CountryName>\n    </Body>\n</Envelope>",
          "comment" : ""
        },
        "headersSize" : 0,
        "bodySize" : 0,
        "comment" : ""
      },
      "response" : {
        "status" : 200,
        "statusText" : "",
        "httpVersion" : "",
        "cookies" : [ ],
        "headers" : [ ],
        "content" : {
          "size" : 341,
          "mimeType" : "application/xml",
          "text" : "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n  <soap:Body>\r\n    <m:CountryNameResponse xmlns:m=\"http://www.oorsprong.org/websamples.countryinfo\">\r\n      <m:CountryNameResult>Åland Islands</m:CountryNameResult>\r\n    </m:CountryNameResponse>\r\n  </soap:Body>\r\n</soap:Envelope>",
          "comment" : ""
        },
        "redirectURL" : "",
        "headersSize" : 163,
        "bodySize" : 340,
        "comment" : ""
      },
      "cache" : { },
      "timings" : {
        "comment" : "",
        "ssl" : -1,
        "send" : 0,
        "wait" : 0,
        "dns" : -1,
        "blocked" : -1,
        "connect" : -1,
        "receive" : 0
      },
      "comment" : "",
      "_katalonRequestInformation" : {
        "name" : "2",
        "testObjectId" : "Object Repository/Soap/countryName",
        "harId" : "3c727b8e-33f8-4c8b-aa39-2260b0dec78b"
      },
      "time" : 0
    } ],
    "comment" : ""
  }
}